package Automat_paskage;

/*
 * Написать программу, которая моделирует автомат по продаже напитков.
 * Напитки могут быть приобретены путем введения правильного количества монет в автомат.
 * Пользователь выбирает напиток из списка доступных, вводит монеты, и либо получает напиток, либо получает монеты назад, если он внес недостаточно денег или если напиток закончился.
 * Напитки могут быть приготовлены и добавлены в ассортимент доступных.
 * Добавьте в программу объект «заказ» и возможность повторить предыдущий заказ
 */
public class Main {
}
